import datetime

t1 = datetime.date.today()
print(t1)
"""
2023-04-23
day1:p11 30:00
认识python
了解python的发展史
了解pycharm的使用
掌握python的注释
掌握python变量的定义与命名规范
掌握python基本操作符
掌握python输入与输出 
-----------------------------------------------------------
01.Python注释
单行注释#和多行注释""""""
特殊注释 #!/usr/bin/env python3;# -- coding=utf-8 --
02.数据类型和命名
数字、布尔值、字符串、字典、元组、列表
type()方法可以查看类型
03.基本操作符
算数运算符 +、-、*、/、**、%、//
比较运算符 ==、! =、>、<、>=、<=
逻辑运算符 and、or、not
赋值运算符 =、+=、-=、*=、/=、%=、**=、//=
04.格式化输出和输入
输入input
输出 s %d f o.format
-----------------------------------------------------------
"""